## Skill Builder Answer Key!

These are my proposed answers for the skill builder assignments. There may be other (or even better!) ways to accomplish the following.

In [1]:
import pandas as pd
import numpy as np
import re

### SB-1

1) Using the string of months separate it into a **list** of individual months.

2) Create a new list of the months as just their first three letters.

3) Create a list of the months with just the first three letters, and CAPITALIZE them

4) Take the first list and capitalize the first letter of each month (extra credit)

In [2]:
months = "january february march april may june july august september october november december"

In [3]:
# 1
month_list = months.split()
print(month_list)

['january', 'february', 'march', 'april', 'may', 'june', 'july', 'august', 'september', 'october', 'november', 'december']

In [4]:
# 2
month_list_short = [month[:3] for month in month_list] # remember your list comprehension!
print(month_list_short)

['jan', 'feb', 'mar', 'apr', 'may', 'jun', 'jul', 'aug', 'sep', 'oct', 'nov', 'dec']

In [5]:
# 3
month_list_short_caps = [month.upper() for month in month_list_short]
print(month_list_short_caps)

['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']

In [6]:
# 4
month_list_caps = [month[0].upper()+month[1:] for month in month_list]
print(month_list_caps)

['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']

In [7]:
# alternatively, there's another way to do the one above
month_list_caps = [month.title() for month in month_list]
print(month_list_caps)

['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']

### SB-2

1) Add a column to the grades_final DataFrame called 'Absences'

2) Set TBAKER's Absences to 3, SMCCOY's to 8, and CECCLES' to 5

3) Change the values in 'W.Avg.' so that students lose a grade point for each absence

4) Return a dataframe of all students who have more than one absence and lower than a 80 for the class

5) Get the class average for the Weighted Average

In [8]:
# code necessary to recreate the DataFrame:
series_a = pd.Series([90,85,88,86,91,79,82,65,88,87,96,98])
student_names = pd.Series(['WHARTNE','PTROUGH','JPERTWE','TBAKER','PDAVISO','CBAKER',
                 'SMCCOY','PMCGANN','CECCLES','DTENNAN','MSMITH','PCAPALD','JWHITTA'])
grades = pd.concat({'Names':student_names,'Midterm':series_a},axis=1)
grades.loc[12,'Midterm'] = 91
final = pd.Series(np.random.randint(69,high=100,size=13))
grades_final = pd.concat([grades,final],axis=1)
grades_final.rename(columns={0:'Final'},inplace=True)
grades_final = grades_final.set_index('Names')
grades_final['Avg.'] = grades_final.mean(axis=1)
grades_final['W.Avg.'] = (grades_final['Midterm'] *.4 + grades_final['Final'] *.6)

In [9]:
# answers using the above dataframe:
# 1
grades_final['Absences'] = 0

In [10]:
# 2 (one way)
grades_final.loc['TBAKER','Absences'] = 3
grades_final.loc['SMCCOY','Absences'] = 8
grades_final.loc['CECCLES','Absences'] = 5

# 2 (other way)
grades_final.loc[['TBAKER','SMCCOY','CECCLES'],'Absences'] = [3,8,5]

In [11]:
# 3
grades_final['W.Avg.'] = grades_final['W.Avg.'] - grades_final['Absences']

In [12]:
# 4 - remember, your output may be different, as some of the grades are generated randomly.
grades_final[(grades_final['Absences'] > 1) & (grades_final['W.Avg.'] < 80)]

        Midterm  Final  Avg.  W.Avg.  Absences
Names
SMCCOY     82.0     89  85.5    78.2         8

In [13]:
grades_final

         Midterm  Final  Avg.  W.Avg.  Absences
Names
WHARTNE     90.0     93  91.5    91.8         0
PTROUGH     85.0     77  81.0    80.2         0
JPERTWE     88.0     72  80.0    78.4         0
TBAKER      86.0     97  91.5    89.6         3
PDAVISO     91.0     88  89.5    89.2         0
CBAKER      79.0     90  84.5    85.6         0
SMCCOY      82.0     89  85.5    78.2         8
PMCGANN     65.0     90  77.5    80.0         0
CECCLES     88.0     83  85.5    80.0         5
DTENNAN     87.0     92  89.5    90.0         0
MSMITH      96.0     78  87.0    85.2         0
PCAPALD     98.0     70  84.0    81.2         0
JWHITTA     91.0     83  87.0    86.2         0

### SB-3

1) Using the text below, create a list of expenditures by day.

2) Take the list from above and create a dictionary

3) Using the dictionary, write the code that returns the amount spent if a day is given

4) convert the values in the dictionary to a format that _preserves the decimal_ (hint)

In [14]:
# triple quotes around the text, ''' like this ''', allow you to write a string across multiple lines.
email_text = '''
    Bill,
    I was just going to follow up with you about the trip. On Friday, I spent $145.53 on lumber and supplies.
    On Saturday, I spent $86.65 on panels and Sunday, I spent $52.28 on adhesives. I have the receipts, and
    I'll drop those by Tuesday.
    Thanks,
    Sarah

'''

In [15]:
# 1
expend = re.findall(r'(\w+day), I spent \$(\d+\.\d+)',email_text)

In [16]:
# 2
daily_spend = dict(expend)

In [17]:
# 3
daily_spend.get('Friday')

'145.53'

In [18]:
# 4
daily_spend_float = {day:float(amount) for day,amount in daily_spend.items()}

### SB-4

1) Write a new function called three_groups that takes a single argument called cellVal

2) Using this function, perform the following three operations based upon the size of the number: (You'll need a new tool called elif (else-if) for the middle one. Try it!)

    - 0-11: Multiply it by 10
    - 12-23: Subtract 6
    - 24-35: Square it
    
3) Run the function on each value in the DataFrame

In [19]:
test_data = pd.DataFrame(np.arange(36).reshape(6,6),columns=('alpha','bravo','charlie','delta','echo','foxtrot'))

In [20]:
def three_groups(cellVal):
    if cellVal < 12:
        return cellVal * 10
    elif cellVal < 24: # note: we don't need to check to see if it's greater than 11, we already did!
        return cellVal - 6
    else:
        return cellVal ** 2

In [21]:
test_data

   alpha  bravo  charlie  delta  echo  foxtrot
0      0      1        2      3     4        5
1      6      7        8      9    10       11
2     12     13       14     15    16       17
3     18     19       20     21    22       23
4     24     25       26     27    28       29
5     30     31       32     33    34       35

In [22]:
test_data.applymap(three_groups)

   alpha  bravo  charlie  delta  echo  foxtrot
0      0     10       20     30    40       50
1     60     70       80     90   100      110
2      6      7        8      9    10       11
3     12     13       14     15    16       17
4    576    625      676    729   784      841
5    900    961     1024   1089  1156     1225